########################################
#   String Methods
########################################

dir(int) 

dir(str)

########################################
# len
########################################

name="Hasan Ozgur"

type(name)
type(len) # Size 

len(name)

# Bir class içiersinde ise method değilse fonks

###############################################
#    upper() & lower(): küçük-büyük Dönüşümleri 
###############################################

"hasan_ozgur".upper()
"HASAN OZGUR".lower()


################################################
#   replace() Değişitme
################################################

hi="Hello AI Era"
hi.replace('H', 'l')


##############################################
#       Split Böler
##############################################

"Hello, AI Era".split(',')


##############################################
# Strip Kırpma
##############################################
"          ofofofofo".strip()
"ofofofofo".strip('o')
